package a10_interface_abstract;

public class 클래스문제 {
    // # Java 클래스, 추상클래스, 인터페이스

    // 1. 자바에서 클래스를 상속받을 때 사용하는 키워드는? extends

    // 2. 자바에서 인터페이스를 구현할 때 사용하는 키워드는? implements

    // 3. 추상 메소드를 선언할 때 사용하는 키워드는? abstract

    // 4. 인터페이스의 모든 메소드의 기본 접근 제어자는? public

    // 5. 자바에서 한 클래스가 동시에 상속받을 수 있는 클래스의 개수는? 1개

    // 6. 인터페이스에서 선언되는 모든 변수의 기본 제어자 3가지는? public static final

    // 7. 자바 8부터 인터페이스에서 구현부를 가질 수 있는 메소드를 선언할 때 사용하는 키워드는? dufault

    // 8. 추상 클래스와 달리 인터페이스에서는 생성자를 가질 수 없는 이유는?
    // <추상클래스는 상태를 저장할 수 있는 필드를 가질 수 있기 때문에
    // 이 상태의 초기화를 위해 생성자를 가질 수 있으나
    // 인터페이스는 상태(필드)를 가질 수 없으므로 생성자가 필요없음>

    // 9. 클래스가 여러 개의 인터페이스를 동시에 구현할 수 있는 최대 개수는? 제한없음

    // 10. 자바에서 클래스나 메소드를 final로 선언했을 때의 의미는?
    // final 클래스는 상속금지 final 메소드는 오버라이드 금지

    // 11. 추상 클래스를 인스턴스화할 수 없는 이유는? 미완성 메서드를 포함하고 있기 때문

    // 12. 인터페이스의 모든 메소드가 default 메소드로 구현되어 있다면,
    // 이 인터페이스를 구현하는 클래스는 반드시 모든 메소드를 오버라이딩해야 하는가? 오버라이딩하지 않아도 됨

    // 13. 추상 클래스가 인터페이스와 달리 가질 수 있는 것은? 생성자

    // 14. 클래스의 멤버 변수를 private으로 선언하고 public 메소드로
    // 접근하도록 하는 방식을 클래스의 무엇이라 하는가?
    // 캡슐화
}
